app/controllers/hydrants_controller.rb

  def index
    @hydrants = Hydrant.all
---
SELECT * FROM `hydrants`

  def show
    @hydrant = Hydrant.find(params[:id])
---
SELECT * FROM `hydrants` WHERE (`hydrants`.`id` = 0)

  def edit
    @hydrant = Hydrant.find(params[:id])
---
SELECT * FROM `hydrants` WHERE (`hydrants`.`id` = 1)

  def create
    @hydrant = Hydrant.new(params[:hydrant])

    respond_to do |format|
      if @hydrant.save
---
INSERT INTO `hydrants` (`latitude`, `updated_at`, `serviced`, `color`, `longitude`, `created_at`) VALUES('47.490340440782525', '2009-08-04 22:40:54', '2009-08-04 22:40:00', 'red', '-117.58632659912111', '2009-08-04 22:40:54')

  def update
    @hydrant = Hydrant.find(params[:id])

    respond_to do |format|
      if @hydrant.update_attributes(params[:hydrant])
---
SELECT * FROM `hydrants` WHERE (`hydrants`.`id` = 1)
UPDATE `hydrants` SET `latitude` = '47.49221081203109', `longitude` = '-117.5878930091858', `updated_at` = '2009-08-06 20:41:36' WHERE `id` = 1