app/controllers/search_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1 AND (CONCAT(first,' ',last) LIKE 'a'))
---
  def user
    @users = User.find(:all, :conditions=>"CONCAT(first,' ',last) LIKE '%"+params[:part]+"%'")