app/controllers/users_controller.rb

SELECT * FROM `groups`
---
  def new
    @user = User.new
    @groups = Group.all

SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `groups`
---
  def edit
    @user = User.find(params[:id])
    @groups = Group.all

INSERT INTO `users` (`username`, `last`, `first`, `group_id`, `password`) VALUES('achernikov', 'Chernikov', 'Alex', 3, 'password')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save